/*
 Программа электрооборудования (регистратора температуры) снаряда-свидетеля 
 Дата создания: 10.10.2017
 Автор: Субботин А.С.
 Версия 2.1.0
 Дата создания версии: 04.06.2019
 Устройство хранения информации: FLASH-память SPI AT25DF161-SH-T 
 
 */
//==============================================================
// Подключение библиотек
//==============================================================
#include <SPI.h>
#include <SD.h>

#include "define.h"
#include "cIncoming.h"
#include "cTime"
#include "cMesurement.h"

//==============================================================
// Константы
//==============================================================

//==============================================================
// Глобальные переменные
//==============================================================

cMesurement cIncoming::Mesurement;  //Объект управления измерениями

cTime cMesurement::Time;            // Объект учёта времени

cFlash cMesurement::Flash;          //Компонент управления энергонезависимой памятью

cIncoming Incoming;                 //Коммуникационная составляющая

SPISettings sStatus::mySet(100000, MSBFIRST, SPI_MODE0);//Установка режима работы SPI

//==============================================================
// Программа начальной установки
//==============================================================
void setup() 
{
  Serial.begin(SERIAL_SPEED);

  cMesurement::Flash.install(CS_PIN);   //Инициализация конфигурации микросхемы памяти
  SPI.begin();                          //Инициализация SPI

  //Инициализация процесса измерений
  cIncoming::Mesurement.install();
  
}//End of void setup() 

//==============================================================
// Главный цикл пограммы
//==============================================================
void loop() 
{
  // Процесс работы с последовательным портом
  Incoming.operate();

  // Процесс измерений 
  cIncoming::Mesurement.operate();
  
}//End of void loop()


//==============================================================
// Подпрограммы
//==============================================================

